In [41]:
# Data Processing

# import libraries

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [8]:
# import dataset
dataset=pd.read_csv("Data.csv")
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [3]:
# Purchase act as a classifiers for the dataset
# decision making :- salary>age>country
# purchase :- [y ] dependent peremiter / CLASSISFIERS imp
# salary,age,country :- independent columns [x]

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Country    10 non-null     object
 1   Age        9 non-null      float64
 2   Salary     9 non-null      float64
 3   Purchased  10 non-null     object
dtypes: float64(2), object(2)
memory usage: 452.0+ bytes

In [6]:
dataset.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [14]:
# neglect the last column
# Independent
x=dataset.iloc[:,:-1].values 
# dependent 
y=dataset.iloc[:,-1].values

In [15]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [16]:
# Handling the missing values 
from sklearn.impute import SimpleImputer
imputer=SimpleImputer (missing_values=np.nan, strategy='mean')
imputer.fit(x[:,1:3])
x[:,1:3] = imputer.transform(x[:,1:3])

In [17]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [18]:
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [20]:
#Splitting the data into the training and testing datasets

In [21]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x, y,test_size=0.2,random_state=0)

In [22]:
x_train

array([['Germany', 40.0, 63777.77777777778],
       ['France', 37.0, 67000.0],
       ['Spain', 27.0, 48000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Spain', 38.0, 61000.0],
       ['France', 44.0, 72000.0],
       ['France', 35.0, 58000.0]], dtype=object)

In [23]:
x_test

array([['Germany', 30.0, 54000.0],
       ['Germany', 50.0, 83000.0]], dtype=object)

In [24]:
y_train

array(['Yes', 'Yes', 'Yes', 'No', 'Yes', 'No', 'No', 'Yes'], dtype=object)

In [25]:
y_test

array(['No', 'No'], dtype=object)

# Encoding categorical data

In [26]:
# Label Encoding
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
labelencoder=LabelEncoder()
x[:,0]=labelencoder.fit_transform(x[:,0])

In [27]:
# role of lable encoder
x

array([[0, 44.0, 72000.0],
       [2, 27.0, 48000.0],
       [1, 30.0, 54000.0],
       [2, 38.0, 61000.0],
       [1, 40.0, 63777.77777777778],
       [0, 35.0, 58000.0],
       [2, 38.77777777777778, 52000.0],
       [0, 48.0, 79000.0],
       [1, 50.0, 83000.0],
       [0, 37.0, 67000.0]], dtype=object)

In [34]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

col_t=ColumnTransformer([('encoder',OneHotEncoder(),[0])])
x1=np.array(col_t.fit_transform(x),dtype=np.str_)

In [36]:
x1

array([['0.0', '1.0'],
       ['1.0', '0.0'],
       ['1.0', '0.0'],
       ['1.0', '0.0'],
       ['1.0', '0.0'],
       ['0.0', '1.0'],
       ['1.0', '0.0'],
       ['0.0', '1.0'],
       ['1.0', '0.0'],
       ['0.0', '1.0']], dtype='<U32')

# Feature Scaling

In [38]:
from sklearn.preprocessing import StandardScaler
sc_x=StandardScaler()
x1=sc_x.fit_transform(x1)
#x_test=sc_x.transform(x_test)

In [39]:
x1

array([[-1.22474487,  1.22474487],
       [ 0.81649658, -0.81649658],
       [ 0.81649658, -0.81649658],
       [ 0.81649658, -0.81649658],
       [ 0.81649658, -0.81649658],
       [-1.22474487,  1.22474487],
       [ 0.81649658, -0.81649658],
       [-1.22474487,  1.22474487],
       [ 0.81649658, -0.81649658],
       [-1.22474487,  1.22474487]])

In [40]:
# hw :[titanic]

In [42]:
df=pd.read_csv('titanic.csv')

In [43]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [45]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [46]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [47]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [53]:
#df.Pclass.unique() --> array([3, 1, 2], dtype=int64)
#df.Survived.unique() --> array([0, 1], dtype=int64)
#df.Sex.unique() --> array(['male', 'female'], dtype=object)

array(['male', 'female'], dtype=object)

In [61]:
df1=df[['PassengerId','Name','Age','Sex','Survived']]

In [62]:
df1

,PassengerId,Name,Age,Sex,Survived
0,1,"Braund, Mr. Owen Harris",22.0,male,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,female,1
2,3,"Heikkinen, Miss. Laina",26.0,female,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,female,1
4,5,"Allen, Mr. William Henry",35.0,male,0
...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",27.0,male,0
887,888,"Graham, Miss. Margaret Edith",19.0,female,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",NaN,female,0
889,890,"Behr, Mr. Karl Howell",26.0,male,1
890,891,"Dooley, Mr. Patrick",32.0,male,0

In [60]:
df1.Survived.unique()
df1.Sex.unique()

array(['male', 'female'], dtype=object)

In [72]:
x=df1.iloc[:,:-1].values
y=df1.iloc[:,-1].values

In [71]:
x

array([[1, 'Braund, Mr. Owen Harris', 22.0, 'male'],
       [2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 38.0,
        'female'],
       [3, 'Heikkinen, Miss. Laina', 26.0, 'female'],
       ...,
       [889, 'Johnston, Miss. Catherine Helen "Carrie"', nan, 'female'],
       [890, 'Behr, Mr. Karl Howell', 26.0, 'male'],
       [891, 'Dooley, Mr. Patrick', 32.0, 'male']], dtype=object)

In [73]:
y

array([0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1,
       1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0,
       0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1,
       0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0,
       0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0,
       1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 0,
       0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1,
       1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0,
       0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0], dtype=int64)

In [82]:
imp=SimpleImputer(missing_values=np.nan, strategy='mean')
imp.fit(x[:,2:3]) # where to apply or fit the data
x[:,2:3]=imp.transform(x[:,2:3])

In [83]:
x

array([[1, 'Braund, Mr. Owen Harris', 22.0, 'male'],
       [2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 38.0,
        'female'],
       [3, 'Heikkinen, Miss. Laina', 26.0, 'female'],
       ...,
       [889, 'Johnston, Miss. Catherine Helen "Carrie"',
        29.69911764705882, 'female'],
       [890, 'Behr, Mr. Karl Howell', 26.0, 'male'],
       [891, 'Dooley, Mr. Patrick', 32.0, 'male']], dtype=object)

In [90]:
from sklearn.model_selection import train_test_split

In [91]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [92]:
x_train

array([[141, 'Boulos, Mrs. Joseph (Sultana)', 29.69911764705882,
        'female'],
       [440, 'Kvillner, Mr. Johan Henrik Johannesson', 31.0, 'male'],
       [818, 'Mallet, Mr. Albert', 31.0, 'male'],
       ...,
       [630, "O'Connell, Mr. Patrick D", 29.69911764705882, 'male'],
       [560, 'de Messemaeker, Mrs. Guillaume Joseph (Emma)', 36.0,
        'female'],
       [685, 'Brown, Mr. Thomas William Solomon', 60.0, 'male']],
      dtype=object)

In [93]:
y_train

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1,
       0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1,
       1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0,
       0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1,
       1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0,
       0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1,
       1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0,
       1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1,
       1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 0, 1, 1, 0, 1,
       0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 1,
       1, 1, 1, 1, 1, 0, 1, 0], dtype=int64)

In [94]:
x_test

array([[496, 'Yousseff, Mr. Gerious', 29.69911764705882, 'male'],
       [649, 'Willey, Mr. Edward', 29.69911764705882, 'male'],
       [279, 'Rice, Master. Eric', 7.0, 'male'],
       [32, 'Spencer, Mrs. William Augustus (Marie Eugenie)',
        29.69911764705882, 'female'],
       [256, 'Touma, Mrs. Darwis (Hanne Youssef Razi)', 29.0, 'female'],
       [299, 'Saalfeld, Mr. Adolphe', 29.69911764705882, 'male'],
       [610, 'Shutes, Miss. Elizabeth W', 40.0, 'female'],
       [319, 'Wick, Miss. Mary Natalie', 31.0, 'female'],
       [485, 'Bishop, Mr. Dickinson H', 25.0, 'male'],
       [368, 'Moussa, Mrs. (Mantoura Boulos)', 29.69911764705882,
        'female'],
       [705, 'Hansen, Mr. Henrik Juul', 26.0, 'male'],
       [347, 'Smith, Miss. Marion Elsie', 40.0, 'female'],
       [197, 'Mernagh, Mr. Robert', 29.69911764705882, 'male'],
       [536, 'Hart, Miss. Eva Miriam', 7.0, 'female'],
       [311, 'Hays, Miss. Margaret Bechstein', 24.0, 'female'],
       [15, 'Vestrom, Miss. Hulda Amanda Adolfina', 14.0, 'female'],
       [351, 'Odahl, Mr. Nils Martin', 23.0, 'male'],
       [146, 'Nicholls, Mr. Joseph Charles', 19.0, 'male'],
       [615, 'Brocklebank, Mr. William Alfred', 35.0, 'male'],
       [804, 'Thomas, Master. Assad Alexander', 0.42, 'male'],
       [145, 'Andrew, Mr. Edgardo Samuel', 18.0, 'male'],
       [709, 'Cleaver, Miss. Alice', 22.0, 'female'],
       [779, 'Kilgannon, Mr. Thomas J', 29.69911764705882, 'male'],
       [271, 'Cairns, Mr. Alexander', 29.69911764705882, 'male'],
       [475, 'Strandberg, Miss. Ida Sofia', 22.0, 'female'],
       [320, 'Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)',
        40.0, 'female'],
       [520, 'Pavlovic, Mr. Stefo', 32.0, 'male'],
       [142, 'Nysten, Miss. Anna Sofia', 22.0, 'female'],
       [881, 'Shelley, Mrs. William (Imanita Parrish Hall)', 25.0,
        'female'],
       [643, 'Skoog, Miss. Margit Elizabeth', 2.0, 'female'],
       [286, 'Stankovic, Mr. Ivan', 33.0, 'male'],
       [459, 'Toomey, Miss. Ellen', 50.0, 'female'],
       [201, 'Vande Walle, Mr. Nestor Cyriel', 28.0, 'male'],
       [56, 'Woolner, Mr. Hugh', 29.69911764705882, 'male'],
       [478, 'Braund, Mr. Lewis Richard', 29.0, 'male'],
       [633, 'Stahelin-Maeglin, Dr. Max', 32.0, 'male'],
       [819, 'Holm, Mr. John Fredrik Alexander', 43.0, 'male'],
       [884, 'Banfield, Mr. Frederick James', 28.0, 'male'],
       [667, 'Butler, Mr. Reginald Fenton', 25.0, 'male'],
       [318, 'Moraweck, Dr. Ernest', 54.0, 'male'],
       [588, 'Frolicher-Stehli, Mr. Maxmillian', 60.0, 'male'],
       [694, 'Saad, Mr. Khalil', 25.0, 'male'],
       [539, 'Risien, Mr. Samuel Beard', 29.69911764705882, 'male'],
       [687, 'Panula, Mr. Jaako Arnold', 14.0, 'male'],
       [231, 'Harris, Mrs. Henry Birkhardt (Irene Wallach)', 35.0,
        'female'],
       [102, 'Petroff, Mr. Pastcho ("Pentcho")', 29.69911764705882,
        'male'],
       [657, 'Radeff, Mr. Alexander', 29.69911764705882, 'male'],
       [312, 'Ryerson, Miss. Emily Borie', 18.0, 'female'],
       [809, 'Meyer, Mr. August', 39.0, 'male'],
       [263, 'Taussig, Mr. Emil', 52.0, 'male'],
       [741, 'Hawksford, Mr. Walter James', 29.69911764705882, 'male'],
       [98, 'Greenfield, Mr. William Bertram', 23.0, 'male'],
       [751, 'Wells, Miss. Joan', 4.0, 'female'],
       [567, 'Stoytcheff, Mr. Ilia', 19.0, 'male'],
       [840, 'Marechal, Mr. Pierre', 29.69911764705882, 'male'],
       [656, 'Hickman, Mr. Leonard Mark', 24.0, 'male'],
       [253, 'Stead, Mr. William Thomas', 62.0, 'male'],
       [543, 'Andersson, Miss. Sigrid Elisabeth', 11.0, 'female'],
       [820, 'Skoog, Master. Karl Thorsten', 10.0, 'male'],
       [302, 'McCoy, Mr. Bernard', 29.69911764705882, 'male'],
       [61, 'Sirayanian, Mr. Orsen', 22.0, 'male'],
       [568, 'Palsson, Mrs. Nils (Alma Cornelia Berglund)', 29.0,
        'female'],
       [497, 'Eustis, Miss. Elizabeth Mussey', 54.0, 'female'],
       [767, 'Brewe, Dr. Arthur Jackson', 29.69911764705882, 'male'],
       [9, 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', 27.0,
        'female'],
       [891, 'Dooley, Mr. Patrick', 32.0, 'male'],
       [797, 'Leader, Dr. Alice (Farnham)', 49.0, 'female'],
       [849, 'Harper, Rev. John', 28.0, 'male'],
       [531, 'Quick, Miss. Phyllis May', 2.0, 'female'],
       [888, 'Graham, Miss. Margaret Edith', 19.0, 'female'],
       [317, 'Kantor, Mrs. Sinai (Miriam Sternin)', 24.0, 'female'],
       [713, 'Taylor, Mr. Elmer Zebley', 48.0, 'male'],
       [35, 'Meyer, Mr. Edgar Joseph', 28.0, 'male'],
       [78, 'Moutal, Mr. Rahamin Haim', 29.69911764705882, 'male'],
       [677, 'Sawyer, Mr. Frederick Charles', 24.5, 'male'],
       [727, 'Renouf, Mrs. Peter Henry (Lillian Jefferys)', 30.0,
        'female'],
       [28, 'Fortune, Mr. Charles Alexander', 19.0, 'male'],
       [31, 'Uruchurtu, Don. Manuel E', 40.0, 'male'],
       [203, 'Johanson, Mr. Jakob Alfred', 34.0, 'male'],
       [182, 'Pernot, Mr. Rene', 29.69911764705882, 'male'],
       [769, 'Moran, Mr. Daniel J', 29.69911764705882, 'male'],
       [490, 'Coutts, Master. Eden Leslie "Neville"', 9.0, 'male'],
       [313, 'Lahtinen, Mrs. William (Anna Sylfven)', 26.0, 'female'],
       [765, 'Eklund, Mr. Hans Linus', 16.0, 'male'],
       [398, 'McKane, Mr. Peter David', 46.0, 'male'],
       [628, 'Longley, Miss. Gretchen Fiske', 21.0, 'female'],
       [381, 'Bidois, Miss. Rosalie', 42.0, 'female'],
       [484, 'Turkula, Mrs. (Hedwig)', 63.0, 'female'],
       [517, 'Lemore, Mrs. (Amelia Milley)', 34.0, 'female'],
       [506, 'Penasco y Castellana, Mr. Victor de Satode', 18.0, 'male'],
       [816, 'Fry, Mr. Richard', 29.69911764705882, 'male'],
       [878, 'Petroff, Mr. Nedelio', 19.0, 'male'],
       [194, 'Navratil, Master. Michel M', 3.0, 'male'],
       [524, 'Hippach, Mrs. Louis Albert (Ida Sophia Fischer)', 44.0,
        'female'],
       [635, 'Skoog, Miss. Mabel', 9.0, 'female'],
       [532, 'Toufik, Mr. Nakli', 29.69911764705882, 'male'],
       [248, 'Hamalainen, Mrs. William (Anna)', 24.0, 'female'],
       [267, 'Panula, Mr. Ernesti Arvid', 16.0, 'male'],
       [695, 'Weir, Col. John', 60.0, 'male'],
       [682, 'Hassab, Mr. Hammad', 27.0, 'male'],
       [684, 'Goodwin, Mr. Charles Edward', 14.0, 'male'],
       [250, 'Carter, Rev. Ernest Courtenay', 54.0, 'male'],
       [716, 'Soholt, Mr. Peter Andreas Lauritz Andersen', 19.0, 'male'],
       [176, 'Klasen, Mr. Klas Albin', 18.0, 'male'],
       [252, 'Strom, Mrs. Wilhelm (Elna Matilda Persson)', 29.0,
        'female'],
       [280, 'Abbott, Mrs. Stanton (Rosa Hunt)', 35.0, 'female'],
       [400, 'Trout, Mrs. William H (Jessie L)', 28.0, 'female'],
       [639, 'Panula, Mrs. Juha (Maria Emilia Ojala)', 41.0, 'female'],
       [729, 'Bryhl, Mr. Kurt Arnold Gottfrid', 25.0, 'male'],
       [613, 'Murphy, Miss. Margaret Jane', 29.69911764705882, 'female'],
       [772, 'Jensen, Mr. Niels Peder', 48.0, 'male'],
       [357, 'Bowerman, Miss. Elsie Edith', 22.0, 'female'],
       [839, 'Chip, Mr. Chang', 32.0, 'male'],
       [565, 'Meanwell, Miss. (Marion Ogden)', 29.69911764705882,
        'female'],
       [391, 'Carter, Mr. William Ernest', 36.0, 'male'],
       [636, 'Davis, Miss. Mary', 28.0, 'female'],
       [143, 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
        24.0, 'female'],
       [701, 'Astor, Mrs. John Jacob (Madeleine Talmadge Force)', 18.0,
        'female'],
       [562, 'Sivic, Mr. Husein', 40.0, 'male'],
       [441, 'Hart, Mrs. Benjamin (Esther Ada Bloomfield)', 45.0,
        'female'],
       [644, 'Foo, Mr. Choong', 29.69911764705882, 'male'],
       [6, 'Moran, Mr. James', 29.69911764705882, 'male'],
       [726, 'Oreskovic, Mr. Luka', 20.0, 'male'],
       [823, 'Reuchlin, Jonkheer. John George', 38.0, 'male'],
       [104, 'Johansson, Mr. Gustaf Joel', 33.0, 'male'],
       [488, 'Kent, Mr. Edward Austin', 58.0, 'male'],
       [523, 'Lahoud, Mr. Sarkis', 29.69911764705882, 'male'],
       [268, 'Persson, Mr. Ernst Ulrik', 25.0, 'male'],
       [414, 'Cunningham, Mr. Alfred Fleming', 29.69911764705882, 'male'],
       [151, 'Bateman, Rev. Robert James', 51.0, 'male'],
       [502, 'Canavan, Miss. Mary', 21.0, 'female'],
       [495, 'Stanley, Mr. Edward Roland', 21.0, 'male'],
       [785, 'Ali, Mr. William', 25.0, 'male'],
       [114, 'Jussila, Miss. Katriina', 20.0, 'female'],
       [546, 'Nicholson, Mr. Arthur Ernest', 64.0, 'male'],
       [38, 'Cann, Mr. Ernest Charles', 21.0, 'male'],
       [215, 'Kiernan, Mr. Philip', 29.69911764705882, 'male'],
       [41, 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)', 40.0,
        'female'],
       [237, 'Hold, Mr. Stephen', 44.0, 'male'],
       [659, 'Eitemiller, Mr. George Floyd', 23.0, 'male'],
       [343, 'Collander, Mr. Erik Gustaf', 28.0, 'male'],
       [413, 'Minahan, Miss. Daisy E', 33.0, 'female'],
       [512, 'Webber, Mr. James', 29.69911764705882, 'male'],
       [655, 'Hegarty, Miss. Hanora "Nora"', 18.0, 'female'],
       [597, 'Leitch, Miss. Jessie Wills', 29.69911764705882, 'female'],
       [294, 'Haas, Miss. Aloisia', 24.0, 'female'],
       [419, 'Matthews, Mr. William John', 30.0, 'male'],
       [433, 'Louch, Mrs. Charles Alexander (Alice Adelaide Slow)', 42.0,
        'female'],
       [300, 'Baxter, Mrs. James (Helene DeLaudeniere Chaput)', 50.0,
        'female'],
       [159, 'Smiljanic, Mr. Mile', 29.69911764705882, 'male'],
       [63, 'Harris, Mr. Henry Birkhardt', 45.0, 'male'],
       [80, 'Dowdell, Miss. Elizabeth', 30.0, 'female'],
       [504, 'Laitinen, Miss. Kristina Sofia', 37.0, 'female'],
       [232, 'Larsson, Mr. Bengt Edvin', 29.0, 'male'],
       [390, 'Lehmann, Miss. Bertha', 17.0, 'female'],
       [620, 'Gavey, Mr. Lawrence', 26.0, 'male'],
       [363, 'Barbara, Mrs. (Catherine David)', 45.0, 'female'],
       [571, 'Harris, Mr. George', 62.0, 'male'],
       [265, 'Henry, Miss. Delia', 29.69911764705882, 'female'],
       [645, 'Baclini, Miss. Eugenie', 0.75, 'female'],
       [385, 'Plotcharsky, Mr. Vasil', 29.69911764705882, 'male'],
       [763, 'Barah, Mr. Hanna Assi', 20.0, 'male'],
       [514, 'Rothschild, Mrs. Martin (Elizabeth L. Barrett)', 54.0,
        'female'],
       [86, 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
        33.0, 'female'],
       [353, 'Elias, Mr. Tannous', 15.0, 'male'],
       [76, 'Moen, Mr. Sigurd Hansen', 25.0, 'male'],
       [632, 'Lundahl, Mr. Johan Svensson', 51.0, 'male'],
       [396, 'Johansson, Mr. Erik', 22.0, 'male'],
       [295, 'Mineff, Mr. Ivan', 24.0, 'male'],
       [501, 'Calic, Mr. Petar', 17.0, 'male'],
       [223, 'Green, Mr. George Henry', 51.0, 'male'],
       [2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 38.0,
        'female'],
       [426, 'Wiseman, Mr. Phillippe', 29.69911764705882, 'male'],
       [761, 'Garfirth, Mr. John', 29.69911764705882, 'male'],
       [781, 'Ayoub, Miss. Banoura', 13.0, 'female'],
       [838, 'Sirota, Mr. Maurice', 29.69911764705882, 'male'],
       [216, 'Newell, Miss. Madeleine', 31.0, 'female'],
       [834, 'Augustsson, Mr. Albert', 23.0, 'male'],
       [373, 'Beavan, Mr. William Thomas', 19.0, 'male']], dtype=object)

In [95]:
y_test

array([0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0,
       1, 0, 0], dtype=int64)

In [96]:
# Encoding 
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [97]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [99]:
lable_encoder=LabelEncoder()
x[:,3]=lable_encoder.fit_transform(x[:,3])

In [100]:
x

array([[1, 'Braund, Mr. Owen Harris', 22.0, 1],
       [2, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', 38.0,
        0],
       [3, 'Heikkinen, Miss. Laina', 26.0, 0],
       ...,
       [889, 'Johnston, Miss. Catherine Helen "Carrie"',
        29.69911764705882, 0],
       [890, 'Behr, Mr. Karl Howell', 26.0, 1],
       [891, 'Dooley, Mr. Patrick', 32.0, 1]], dtype=object)

In [101]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

c_t=ColumnTransformer([('encoder',OneHotEncoder(),[3])])
x_1=np.array(c_t.fit_transform(x),dtype=np.str_)

In [102]:
x_1

array([['0.0', '1.0'],
       ['1.0', '0.0'],
       ['1.0', '0.0'],
       ...,
       ['1.0', '0.0'],
       ['0.0', '1.0'],
       ['0.0', '1.0']], dtype='<U32')

In [103]:
from sklearn.preprocessing import StandardScaler
sc_x=StandardScaler()
x_1=sc_x.fit_transform(x_1)

In [104]:
x_1

array([[-0.73769513,  0.73769513],
       [ 1.35557354, -1.35557354],
       [ 1.35557354, -1.35557354],
       ...,
       [ 1.35557354, -1.35557354],
       [-0.73769513,  0.73769513],
       [-0.73769513,  0.73769513]])